stubs/libxml2/samples/3f1aeceef6cd87f076cd0b2dc1bff5799797b4eb

<!-- $Id: response-7.xml,v 1.1 2005-04-20 19:24:15 pdowney Exp $ -->
<soap:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsa:Action>http://tempuri.org/EchoStringActionResponse</wsa:Action>
        <wsa:MessageID>uuid:64a70e68-a15d-4a2e-9c65-11c4d399baef</wsa:MessageID>
        <wsa:RelatesTo>uuid:52eeff0d-3ea5-4ffb-a551-d40d638575c4</wsa:RelatesTo>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:To>
        <wsse:Security>
            <wsu:Timestamp wsu:Id="Timestamp-9f1a9933-af7e-4c49-8c7f-05dfc60aff2b">
                <wsu:Created>2004-06-16T17:23:42Z</wsu:Created>
                <wsu:Expires>2004-06-16T17:28:42Z</wsu:Expires>
            </wsu:Timestamp>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <string xmlns="http://tempuri.org/">test message</string>
    </soap:Body>
</soap:Envelope>
